/*
** 题目:Packets
** 输入:个数--0 0 0 0 0 0结束
** 作者:赵鑫磊
** poj:1017
** 版本:1.0
*/
#include <stdio.h> 

int main() 
{ 
    int N, a, b, c, d, e, f, y, x ;

     int u[4]={0, 5, 3, 1};      
  // 数组u 表示3*3 的产品数目分别是 4 的倍数，4 的倍数+1, 4的倍数+2, 4的倍数+3 
  // 时，为3*3 的产品打开的新箱子中剩余的2*2 的空位的个数 
   
  while(1){ 
      scanf("%d%d%d%d%d%d", &a, &b, &c, &d, &e, &f); 
      if (a == 0 && b == 0 && c == 0 && d == 0 && e == 0 && f == 0) break; 
      N = f + e + d + (c + 3) / 4;  // 这里有一个小技巧 - (c+3)/4  正好等于 c 除以4 向上取整的结果, 下同  
      y = 5 * d + u[c % 4]; 
      if(b > y)  N += (b - y + 8 ) / 9;
      x = 36 * N - 36 * f - 25 * e - 16 * d - 9 * c - 4 * b; 
      if(a > x)  N += ( a - x + 35 ) / 36;   
	  printf("%d\n", N); 
   }
  return 0;
}